Финансы/src/Documents/ПриходДенежныхСредств/ПриходДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходДенежныхСредств</name>
  <registerRecords>AccumulationRegister.ОстаткиДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>CatalogRef.СчетаУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СразуЗачислять</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КратностьВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Расшифровка</name>
    <attributes>
      <name>СтатьяДоходов</name>
      <type>
        <types>CatalogRef.СтатьиДоходовИРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Финансы/src/Documents/ПриходДенежныхСредств/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Функция ПолучитьВалютуСчета(ПараметрСчетУчета)
	
	Возврат ПараметрСчетУчета.ВалютаСчета;
	
КонецФункции

&НаСервере
Процедура ОбновитьКурсИКратностьДокумента()
	
	СтруктураКурса = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	
	Объект.КурсВзаиморасчетов = СтруктураКурса.Курс;
	Объект.КратностьВзаиморасчетов = СтруктураКурса.Кратность;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДокументПриИзмененииКурсаИлиКратности()
	
	СтруктураКурсаРеглВалюты = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаРегламентированногоУчета, Объект.Дата);
	СтруктураКурсаДокумента = Новый Структура("Валюта, Курс, Кратность", Объект.ВалютаДокумента, Объект.КурсВзаиморасчетов, Объект.КратностьВзаиморасчетов);
	
	Для каждого ТекущаяСтрока Из Объект.Расшифровка Цикл
		ТекущаяСтрока.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьПоКурсу(ТекущаяСтрока.Сумма, СтруктураКурсаДокумента, СтруктураКурсаРеглВалюты);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	Объект.ВалютаДокумента = ПолучитьВалютуСчета(Объект.СчетУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьИтогиДокумента()
	
	Объект.СуммаДокумента = Объект.Расшифровка.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ПересчитатьИтогиДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПослеУдаления(Элемент)

	ПересчитатьИтогиДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Не Копирование Тогда
		
		ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
		ТекущаяСтрока.Количество = 1;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаЦенаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Количество * ТекущаяСтрока.Цена;

КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСуммаПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Расшифровка.ТекущиеДанные;
	
	Если ТекущаяСтрока.Количество = 0 Тогда
		ТекущаяСтрока.Количество = 1;
	КонецЕсли;
	
	Если ТекущаяСтрока.Цена = 0 Тогда
		ТекущаяСтрока.Цена = ТекущаяСтрока.Сумма / ТекущаяСтрока.Количество;
	Иначе
		ТекущаяСтрока.Количество = ТекущаяСтрока.Сумма / ТекущаяСтрока.Цена;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВалютаРегламентированногоУчета = Константы.ОсновнаяВалютаУчета.Получить();
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбновитьКурсИКратностьДокумента();
	КонецЕсли;

КонецПроцедуры
